In [ ]:
!pip install openai

Collecting openai
  Downloading openai-1.3.3-py3-none-any.whl (220 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 220.3/220.3 kB 4.0 MB/s eta 0:00:00
Requirement already satisfied: anyio<4,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai) (3.7.1)
Requirement already satisfied: distro<2,>=1.7.0 in /usr/lib/python3/dist-packages (from openai) (1.7.0)
Collecting httpx<1,>=0.23.0 (from openai)
  Downloading httpx-0.25.1-py3-none-any.whl (75 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 75.0/75.0 kB 8.9 MB/s eta 0:00:00
Requirement already satisfied: pydantic<3,>=1.9.0 in /usr/local/lib/python3.10/dist-packages (from openai) (1.10.13)
Requirement already satisfied: tqdm>4 in /usr/local/lib/python3.10/dist-packages (from openai) (4.66.1)
Requirement already satisfied: typing-extensions<5,>=4.5 in /usr/local/lib/python3.10/dist-packages (from openai) (4.5.0)
Requirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<4,>=3.5.0->openai) (3.4)
Requirement already satisfied: sniffio>=1.1 in /usr/local/lib/python3.10/dist-packages (from anyio<4,>=3.5.0->openai) (1.3.0)
Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<4,>=3.5.0->openai) (1.1.3)
Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1,>=0.23.0->openai) (2023.7.22)
Collecting httpcore (from httpx<1,>=0.23.0->openai)
  Downloading httpcore-1.0.2-py3-none-any.whl (76 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 76.9/76.9 kB 6.5 MB/s eta 0:00:00
Collecting h11<0.15,>=0.13 (from httpcore->httpx<1,>=0.23.0->openai)
  Downloading h11-0.14.0-py3-none-any.whl (58 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 58.3/58.3 kB 5.4 MB/s eta 0:00:00
Installing collected packages: h11, httpcore, httpx, openai
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
llmx 0.0.15a0 requires cohere, which is not installed.
llmx 0.0.15a0 requires tiktoken, which is not installed.
Successfully installed h11-0.14.0 httpcore-1.0.2 httpx-0.25.1 openai-1.3.3

In [ ]:
import argparse
import json
import time
import openai
import pandas as pd
import re
import os
import sqlite3
import subprocess
from tqdm import tqdm

In [ ]:
import openai
api_key = "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"
openai.api_key = api_key

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
def creatiing_schema(DATASET_JSON):
    schema_df = pd.read_json(DATASET_JSON)
    schema_df = schema_df.drop(['column_names','table_names'], axis=1)
    schema = []
    f_keys = []
    p_keys = []
    for index, row in schema_df.iterrows():
        tables = row['table_names_original']
        col_names = row['column_names_original']
        col_types = row['column_types']
        foreign_keys = row['foreign_keys']
        primary_keys = row['primary_keys']
        for col, col_type in zip(col_names, col_types):
            index, col_name = col
            if index == -1:
                for table in tables:
                    schema.append([row['db_id'], table, '*', 'text'])
            else:
                schema.append([row['db_id'], tables[index], col_name, col_type])
        for primary_key in primary_keys:
            index, column = col_names[primary_key]
            p_keys.append([row['db_id'], tables[index], column])
        for foreign_key in foreign_keys:
            first, second = foreign_key
            first_index, first_column = col_names[first]
        #table name index, column name
            second_index, second_column = col_names[second]
            f_keys.append([row['db_id'], tables[first_index], tables[second_index], first_column, second_column])
    spider_schema = pd.DataFrame(schema, columns=['Database name', ' Table Name', ' Field Name', ' Type'])
    spider_primary = pd.DataFrame(p_keys, columns=['Database name', 'Table Name', 'Primary Key'])
    spider_foreign = pd.DataFrame(f_keys,
                        columns=['Database name', 'First Table Name', 'Second Table Name', 'First Table Foreign Key',
                                 'Second Table Foreign Key'])
    return spider_schema,spider_primary,spider_foreign
DATASET_SCHEMA='/content/drive/MyDrive/spider/tables.json'
spider_schema,spider_primary,spider_foreign=creatiing_schema(DATASET_SCHEMA)
DATASET = '/content/drive/MyDrive/spider/dev.json'
df_val=pd.read_json(DATASET)

In [ ]:
spider_schema

,Database name,Table Name,Field Name,Type
0,perpetrator,perpetrator,*,text
1,perpetrator,people,*,text
2,perpetrator,perpetrator,Perpetrator_ID,number
3,perpetrator,perpetrator,People_ID,number
4,perpetrator,perpetrator,Date,text
...,...,...,...,...
5374,product_catalog,Catalog_Contents,width,text
5375,product_catalog,Catalog_Contents_Additional_Attributes,catalog_entry_id,number
5376,product_catalog,Catalog_Contents_Additional_Attributes,catalog_level_number,number
5377,product_catalog,Catalog_Contents_Additional_Attributes,attribute_id,number
5378,product_catalog,Catalog_Contents_Additional_Attributes,attribute_value,text

In [ ]:
pd.read_json(DATASET_JSON)

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql
0,concert_singer,SELECT count(*) FROM singer,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]",How many singers do we have?,"[How, many, singers, do, we, have, ?]","{'from': {'table_units': [['table_unit', 1]], ..."
1,concert_singer,SELECT count(*) FROM singer,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]",What is the total number of singers?,"[What, is, the, total, number, of, singers, ?]","{'from': {'table_units': [['table_unit', 1]], ..."
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","Show name, country, age for all singers ordere...","[Show, name, ,, country, ,, age, for, all, sin...","{'from': {'table_units': [['table_unit', 1]], ..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","What are the names, countries, and ages for ev...","[What, are, the, names, ,, countries, ,, and, ...","{'from': {'table_units': [['table_unit', 1]], ..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","What is the average, minimum, and maximum age ...","[What, is, the, average, ,, minimum, ,, and, m...","{'from': {'table_units': [['table_unit', 1]], ..."
...,...,...,...,...,...,...,...
1029,singer,SELECT Citizenship FROM singer WHERE Birth_Yea...,"[SELECT, Citizenship, FROM, singer, WHERE, Bir...","[select, citizenship, from, singer, where, bir...",What are the citizenships that are shared by s...,"[What, are, the, citizenships, that, are, shar...","{'from': {'table_units': [['table_unit', 0]], ..."
1030,real_estate_properties,SELECT count(*) FROM Other_Available_Features,"[SELECT, count, (, *, ), FROM, Other_Available...","[select, count, (, *, ), from, other_available...",How many available features are there in total?,"[How, many, available, features, are, there, i...","{'from': {'table_units': [['table_unit', 2]], ..."
1031,real_estate_properties,SELECT T2.feature_type_name FROM Other_Availab...,"[SELECT, T2.feature_type_name, FROM, Other_Ava...","[select, t2, ., feature_type_name, from, other...",What is the feature type name of feature AirCon?,"[What, is, the, feature, type, name, of, featu...","{'from': {'table_units': [['table_unit', 2], [..."
1032,real_estate_properties,SELECT T2.property_type_description FROM Prope...,"[SELECT, T2.property_type_description, FROM, P...","[select, t2, ., property_type_description, fro...",Show the property type descriptions of propert...,"[Show, the, property, type, descriptions, of, ...","{'from': {'table_units': [['table_unit', 3], [..."
1033,real_estate_properties,SELECT property_name FROM Properties WHERE pro...,"[SELECT, property_name, FROM, Properties, WHER...","[select, property_name, from, properties, wher...",What are the names of properties that are eith...,"[What, are, the, names, of, properties, that, ...","{'from': {'table_units': [['table_unit', 3]], ..."

In [ ]:
print(find_fields_MYSQL_like('concert_singer'))

Table concert, columns = [*,concert_ID,concert_Name,Theme,Stadium_ID,Year]
Table singer, columns = [*,Singer_ID,Name,Country,Song_Name,Song_release_year,Age,Is_male]
Table singer_in_concert, columns = [*,concert_ID,Singer_ID]
Table stadium, columns = [*,Stadium_ID,Location,Name,Capacity,Highest,Lowest,Average]

In [ ]:
def find_fields_MYSQL_like(db_name):
  df = spider_schema[spider_schema['Database name'] == db_name]
  df = df.groupby(' Table Name')
  output = ""
  for name, group in df:
    output += "Table " +name+ ', columns = ['
    for index, row in group.iterrows():
      output += row[" Field Name"]+','
    output = output[:-1]
    output += "]\n"
  return output
def find_foreign_keys_MYSQL_like(db_name):
  df = spider_foreign[spider_foreign['Database name'] == db_name]
  output = "["
  for index, row in df.iterrows():
    output += row['First Table Name'] + '.' + row['First Table Foreign Key'] + " = " + row['Second Table Name'] + '.' + row['Second Table Foreign Key'] + ','
  output= output[:-1] + "]"
  return output

def prompt_maker(test_sample_text,database):
  instruction = "### Complete sqlite SQL query only and with no explanation, and do not select extra columns that are not explicitly requested in the query. " \
                        "\n ### Sqlite SQL tables, with their properties: \n#\n"
  fields = find_fields_MYSQL_like(database)
  foreign_keys = "Foreign_keys = " + find_foreign_keys_MYSQL_like(database) + '\n'
  prompt = instruction +  fields +foreign_keys+ 'Q: "' + test_sample_text + '\nSELECT' ##prompt
  return prompt

def generate_reply(messages, n):
    completions = openai.ChatCompletion.create(
        model="gpt-3.5-turbo",
        messages=messages,
        n=n
    )
    # print(completions)
    mes = completions.choices[0].message.content
    all_p_sqls = []
    for i in range(n):
        all_p_sqls.append(completions.choices[i].message.content.replace("\n", " "))
    return all_p_sqls

In [ ]:
find_fields_MYSQL_like(df_val['db_id'][5])

'Table concert, columns = [*,concert_ID,concert_Name,Theme,Stadium_ID,Year]\nTable singer, columns = [*,Singer_ID,Name,Country,Song_Name,Song_release_year,Age,Is_male]\nTable singer_in_concert, columns = [*,concert_ID,Singer_ID]\nTable stadium, columns = [*,Stadium_ID,Location,Name,Capacity,Highest,Lowest,Average]\n'

In [ ]:
find_foreign_keys_MYSQL_like(df_val['db_id'][5])

'[concert.Stadium_ID = stadium.Stadium_ID,singer_in_concert.Singer_ID = singer.Singer_ID,singer_in_concert.concert_ID = concert.concert_ID]'

In [ ]:
chat_prompt = [
    {
        "role": "system",
        "content": "You are now an excellent SQL writer, first I'll give you some tips and examples, and I need you to remember the tips, and do not make same mistakes."
    },
    {
        "role": "user",
        "content": """Tips 1:
Question: Which A has most number of B?
Gold SQL: select A from B group by A order by count ( * ) desc limit 1;
Notice that the Gold SQL doesn't select COUNT(*) because the question only wants to know the A and the number should be only used in ORDER BY clause, there are many questions asks in this way, and I need you to remember this in the the following questions."""
    },
    {
        "role": "assistant",
        "content": "Thank you for the tip! I'll keep in mind that when the question only asks for a certain field, I should not include the COUNT(*) in the SELECT statement, but instead use it in the ORDER BY clause to sort the results based on the count of that field."
    },
    {
        "role": "user",
        "content": """Tips 2:
Don't use "IN", "OR", "LEFT JOIN" as it might cause extra results, use "INTERSECT" or "EXCEPT" instead, and remember to use "DISTINCT" or "LIMIT" when necessary.
For example,
Question: Who are the A who have been nominated for both B award and C award?
Gold SQL should be: select A from X where award = 'B' intersect select A from X where award = 'C';"""
    },
    {
        "role": "assistant",
        "content": "Thank you for the tip! I'll remember to use \"INTERSECT\" or \"EXCEPT\" instead of \"IN\", \"OR\", or \"LEFT JOIN\" when I want to find records that match or don't match across two tables. Additionally, I'll make sure to use \"DISTINCT\" or \"LIMIT\" when necessary to avoid repetitive results or limit the number of results returned."
    }
]

In [ ]:
# find_foreign_keys_MYSQL_like('perpetrator')
# messages = []
# messages = chat_prompt.copy()
# input = prompt_maker(df_val['question'][2],df_val['db_id'][2])
# messages.append({"role": "user", "content": input})
# p_sql = generate_reply(messages, 1)[0]
# p_sql = 'SELECT ' + p_sql
# p_sql = p_sql.replace("SELECT SELECT", "SELECT")
# #p_sql = fix_select_column(p_sql)
# p_sql = p_sql.replace("> =", ">=").replace("< =", "<=").replace("! =", "!=")
# print(f'p_sql: {p_sql}')

p_sql: SELECT singer.Name, singer.Country, singer.Age  FROM singer  ORDER BY singer.Age DESC;

In [ ]:
df_val[0:10]

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql
0,concert_singer,SELECT count(*) FROM singer,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]",How many singers do we have?,"[How, many, singers, do, we, have, ?]","{'from': {'table_units': [['table_unit', 1]], ..."
1,concert_singer,SELECT count(*) FROM singer,"[SELECT, count, (, *, ), FROM, singer]","[select, count, (, *, ), from, singer]",What is the total number of singers?,"[What, is, the, total, number, of, singers, ?]","{'from': {'table_units': [['table_unit', 1]], ..."
2,concert_singer,"SELECT name , country , age FROM singer ORDE...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","Show name, country, age for all singers ordere...","[Show, name, ,, country, ,, age, for, all, sin...","{'from': {'table_units': [['table_unit', 1]], ..."
3,concert_singer,"SELECT name , country , age FROM singer ORDE...","[SELECT, name, ,, country, ,, age, FROM, singe...","[select, name, ,, country, ,, age, from, singe...","What are the names, countries, and ages for ev...","[What, are, the, names, ,, countries, ,, and, ...","{'from': {'table_units': [['table_unit', 1]], ..."
4,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","What is the average, minimum, and maximum age ...","[What, is, the, average, ,, minimum, ,, and, m...","{'from': {'table_units': [['table_unit', 1]], ..."
5,concert_singer,"SELECT avg(age) , min(age) , max(age) FROM s...","[SELECT, avg, (, age, ), ,, min, (, age, ), ,,...","[select, avg, (, age, ), ,, min, (, age, ), ,,...","What is the average, minimum, and maximum age ...","[What, is, the, average, ,, minimum, ,, and, m...","{'from': {'table_units': [['table_unit', 1]], ..."
6,concert_singer,"SELECT song_name , song_release_year FROM sin...","[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...",Show the name and the release year of the song...,"[Show, the, name, and, the, release, year, of,...","{'from': {'table_units': [['table_unit', 1]], ..."
7,concert_singer,"SELECT song_name , song_release_year FROM sin...","[SELECT, song_name, ,, song_release_year, FROM...","[select, song_name, ,, song_release_year, from...",What are the names and release years for all t...,"[What, are, the, names, and, release, years, f...","{'from': {'table_units': [['table_unit', 1]], ..."
8,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...",What are all distinct countries where singers ...,"[What, are, all, distinct, countries, where, s...","{'from': {'table_units': [['table_unit', 1]], ..."
9,concert_singer,SELECT DISTINCT country FROM singer WHERE age ...,"[SELECT, DISTINCT, country, FROM, singer, WHER...","[select, distinct, country, from, singer, wher...",What are the different countries with singers...,"[What, are, the, different, countries, with, s...","{'from': {'table_units': [['table_unit', 1]], ..."

In [ ]:

prediction=[]
# Iterating through each row of df_val using iterrows()
for index, row in df_val.iterrows():
    messages = []
    messages = chat_prompt.copy()
    input = prompt_maker(row['question'], row['db_id'])
    messages.append({"role": "user", "content": input})
    p_sql = generate_reply(messages, 1)[0]
    p_sql = 'SELECT ' + p_sql
    p_sql = p_sql.replace("SELECT SELECT", "SELECT")
    #p_sql = fix_select_column(p_sql)
    p_sql = p_sql.replace("> =", ">=").replace("< =", "<=").replace("! =", "!=")
    p_sql = p_sql.replace("\n", " ")
    while "  " in p_sql:
          p_sql = p_sql.replace("  ", " ")
    prediction.append(p_sql)
    print(f'p_sql: {p_sql}')

p_sql: SELECT COUNT(*) FROM singer;
p_sql: SELECT COUNT(*) FROM singer;
p_sql: SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC;
p_sql: SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC
p_sql: SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France';
p_sql: SELECT MIN(Age) as Minimum_Age, MAX(Age) as Maximum_Age, AVG(Age) as Average_Age FROM singer WHERE Country = 'France';
p_sql: SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = (SELECT MIN(Age) FROM singer)
p_sql: SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = ( SELECT MIN(Age) FROM singer )
p_sql: SELECT DISTINCT Country FROM singer WHERE Age > 20;
p_sql: SELECT DISTINCT Country FROM singer WHERE Age > 20;
p_sql: SELECT DISTINCT Country, COUNT(Singer_ID) FROM singer GROUP BY Country;
p_sql: SELECT COUNT(*), Country FROM singer GROUP BY Country;
p_sql: SELECT singer.Song_Name FROM singer WHERE singer.Age > (SELECT AVG(Age) FROM singer);
p_sql: SELECT singer.Song_Name FROM singer WHERE singer.Age > ( SELECT AVG(Age) FROM singer )
p_sql: SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 5000 AND 10000;
p_sql: SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 5000 AND 10000;
p_sql: SELECT MAX(capacity), AVG(capacity) FROM stadium;
p_sql: SELECT AVG(Capacity), MAX(Capacity) FROM stadium;
p_sql: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = ( SELECT MAX(stadium.Average) FROM stadium );
p_sql: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = (SELECT MAX(Average) FROM stadium)
p_sql: SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015;
p_sql: SELECT COUNT(*) FROM concert WHERE Year = 2014 OR Year = 2015;
p_sql: SELECT stadium.Name, COUNT(concert.concert_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY stadium.Name;
p_sql: SELECT stadium.Name, COUNT(concert.concert_ID) as total_concerts FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID GROUP BY stadium.Name;
p_sql: SELECT stadium.Name, stadium.Capacity FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year >= 2014 GROUP BY stadium.Stadium_ID ORDER BY COUNT(*) DESC LIMIT 1;
p_sql: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Stadium_ID = ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year > 2013 GROUP BY concert.Stadium_ID ORDER BY COUNT(*) DESC LIMIT 1 );
p_sql: SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1
p_sql: SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1;
p_sql: SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL;
p_sql: SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL;
p_sql: SELECT DISTINCT Country FROM singer WHERE Age > 40 INTERSECT SELECT DISTINCT Country FROM singer WHERE Age < 30;
p_sql: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 );
p_sql: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 );
p_sql: SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_Name, concert.Theme;
p_sql: SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert INNER JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_ID, concert.concert_Name, concert.Theme;
p_sql: SELECT singer.Name, COUNT(singer_in_concert.concert_ID) as num_concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name;
p_sql: SELECT singer.Name, COUNT(singer_in_concert.concert_ID) AS Number_of_Concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name;
p_sql: SELECT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON concert.concert_ID = singer_in_concert.concert_ID WHERE concert.Year = 2014;
p_sql: SELECT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON singer_in_concert.concert_ID = concert.concert_ID WHERE concert.Year = 2014;
p_sql: SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE '%Hey%'
p_sql: SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE '%Hey%';
p_sql: SELECT stadium.Name, stadium.Location FROM stadium WHERE stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 ) AND stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2015 );
p_sql: SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 2014 INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 2015;
p_sql: SELECT COUNT(*) FROM concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = (SELECT MAX(Capacity) FROM stadium) );
p_sql: SELECT COUNT(*) FROM concert WHERE stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = ( SELECT MAX(Capacity) FROM stadium ) );
p_sql: SELECT COUNT(*) FROM Pets WHERE weight > 10;
p_sql: SELECT COUNT(*) FROM Pets WHERE weight > 10;
p_sql: SELECT MIN(Pets.pet_age) AS youngest_age, Pets.weight FROM Pets WHERE Pets.PetType = 'dog';
p_sql: SELECT MIN(weight) FROM Pets WHERE PetType = 'dog'
p_sql: SELECT MAX(weight) AS max_weight, PetType FROM Pets GROUP BY PetType;
p_sql: SELECT MAX(weight), PetType FROM Pets GROUP BY PetType;
p_sql: SELECT COUNT(*) FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Age > 20;
p_sql: SELECT COUNT(*) FROM Has_Pet INNER JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Student.Age > 20
p_sql: SELECT count(*) FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Pets.PetType = 'dog' AND Student.Sex = 'F';
p_sql: SELECT COUNT(*) FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Pets.PetType = 'dog' AND Student.Sex = 'female';
p_sql: SELECT COUNT(DISTINCT PetType) FROM Pets;
p_sql: SELECT COUNT(DISTINCT PetType) FROM Pets;
p_sql: SELECT Student.Fname FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog');
p_sql: SELECT Student.FName FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog');
p_sql: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Student.StuID IN ( SELECT StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' ) GROUP BY Student.Fname;
p_sql: SELECT Student.Fname FROM Student WHERE EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'cat' ) AND EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'dog' );
p_sql: SELECT Major, Age FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'Cat'));
p_sql: SELECT Student.Major, Student.Age FROM Student WHERE Student.StuID NOT IN ( SELECT StuID FROM Has_Pet WHERE PetID IN ( SELECT PetID FROM Pets WHERE PetType = 'Cat' ) );
p_sql: SELECT Student.StuID FROM Student LEFT JOIN Has_Pet ON Student.StuID = Has_Pet.StuID LEFT JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType <> 'cat' OR Pets.PetType IS NULL;
p_sql: SELECT Student.StuID FROM Student WHERE Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE PetType = 'Cat' );
p_sql: SELECT Student.FName, Student.Age FROM Student WHERE Student.StuID IN ( 	SELECT Has_Pet.StuID 	FROM Has_Pet 	INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID 	WHERE Pets.PetType = 'dog' ) AND Student.StuID NOT IN ( 	SELECT Has_Pet.StuID 	FROM Has_Pet 	INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID 	WHERE Pets.PetType = 'cat' );
p_sql: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' AND Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' );
p_sql: SELECT Pets.PetType, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets);
p_sql: SELECT Pets.PetType, Pets.pet_age, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets) LIMIT 1;
p_sql: SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1;
p_sql: SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1;
p_sql: SELECT Pets.PetType, AVG(Pets.pet_age) AS average_age, MAX(Pets.pet_age) AS maximum_age FROM Pets GROUP BY Pets.PetType;
p_sql: SELECT Pets.PetType, AVG(Pets.pet_age), MAX(Pets.pet_age) FROM Pets GROUP BY Pets.PetType;
p_sql: SELECT PetType, AVG(weight) AS AverageWeight FROM Pets GROUP BY PetType;
p_sql: SELECT Pets.PetType, AVG(Pets.weight) AS AverageWeight FROM Pets GROUP BY Pets.PetType;
p_sql: SELECT Student.Fname, Student.Age FROM Student WHERE Student.StuID IN ( SELECT Has_Pet.StuID FROM Has_Pet )
p_sql: SELECT Student.FName, Student.Age FROM Student WHERE Student.StuID IN ( SELECT StuID FROM Has_Pet )
p_sql: SELECT Pets.PetID FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.LName = 'Smith';
p_sql: SELECT Pets.PetID FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.LName = 'Smith';
p_sql: SELECT COUNT(*) as pet_count, Has_Pet.StuID FROM Has_Pet GROUP BY Has_Pet.StuID
p_sql: SELECT Has_Pet.StuID, COUNT(Has_Pet.PetID) FROM Has_Pet GROUP BY Has_Pet.StuID;
p_sql: SELECT Student.Fname, Student.Sex FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID GROUP BY Student.StuID HAVING COUNT(Has_Pet.PetID) > 1;
p_sql: SELECT Student.Fname, Student.Sex FROM Student WHERE Student.StuID IN (SELECT StuID FROM Has_Pet GROUP BY StuID HAVING COUNT(*) > 1);
p_sql: SELECT Student.LName FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Pets.pet_age = 3;
p_sql: SELECT Student.LName FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Pets.pet_age = 3 ORDER BY Student.LName DESC LIMIT 1;
p_sql: SELECT AVG(Age) FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet);
p_sql: SELECT AVG(Age) FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet);
p_sql: SELECT COUNT(ContId) FROM continents;
p_sql: SELECT COUNT(*) FROM continents;
p_sql: SELECT continents.ContId, continents.Continent, COUNT(countries.CountryId) AS country_count FROM continents JOIN countries ON continents.ContId = countries.Continent GROUP BY continents.ContId, continents.Continent;
p_sql: SELECT continents.ContId, continents.Continent, COUNT(countries.CountryId) AS Number_of_Countries FROM continents JOIN countries ON countries.Continent = continents.ContId GROUP BY continents.ContId, continents.Continent;
p_sql: SELECT COUNT(DISTINCT CountryId) FROM countries;
p_sql: SELECT COUNT(*) FROM countries;
p_sql: SELECT car_makers.FullName, car_makers.Id, COUNT(model_list.ModelId) as Number_of_Models FROM car_makers JOIN model_list ON model_list.Maker = car_makers.Id GROUP BY car_makers.Id;
p_sql: SELECT car_makers.Id, car_makers.FullName, COUNT(model_list.Model) AS NumOfModels FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker GROUP BY car_makers.Id, car_makers.FullName;
p_sql: SELECT Model FROM cars_data WHERE Horsepower = (SELECT MIN(Horsepower) FROM cars_data);
p_sql: SELECT min(car_data.Horsepower) as Min_Horsepower, car_names.Model as Car_Model FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId ORDER BY Min_Horsepower LIMIT 1;
p_sql: SELECT model_list.Model FROM model_list WHERE model_list.ModelId IN ( SELECT car_names.Model FROM car_names JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Weight < ( SELECT AVG(cars_data.Weight) FROM cars_data ) );
p_sql: SELECT model_list.Model FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model WHERE cars_data.Weight < (SELECT AVG(Weight) FROM cars_data);
p_sql: SELECT car_makers.Maker FROM car_makers JOIN car_names ON car_makers.Id = car_names.MakeId JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year = 1970;
p_sql: SELECT car_makers.Maker FROM car_makers JOIN cars_data ON car_makers.Id = cars_data.Id WHERE cars_data.Year = 1970 GROUP BY car_makers.Maker;
p_sql: SELECT car_makers.Maker, cars_data.Year FROM car_makers JOIN car_names ON car_makers.Id = car_names.MakeId JOIN cars_data ON car_names.Model = cars_data.Model WHERE cars_data.Year = (SELECT MIN(Year) FROM cars_data);
p_sql: SELECT car_makers.Maker, MIN(cars_data.Year) FROM car_makers INNER JOIN car_names ON car_makers.Id = car_names.MakeId INNER JOIN model_list ON car_names.Model = model_list.Model INNER JOIN cars_data ON car_names.MakeId = cars_data.Id GROUP BY car_makers.Maker ORDER BY MIN(cars_data.Year) LIMIT 1;
p_sql: SELECT DISTINCT Model FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model WHERE cars_data.Year > 1980;
p_sql: SELECT model_list.Model FROM model_list JOIN car_makers ON model_list.Maker = car_makers.Id JOIN car_names ON model_list.ModelId = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year > 1980;
p_sql: SELECT Continents.Continent, COUNT(DISTINCT car_makers.Id) AS MakerCount FROM continents LEFT JOIN countries ON continents.ContId = countries.Continent LEFT JOIN car_makers ON countries.CountryId = car_makers.Country GROUP BY continents.Continent;
p_sql: SELECT continents.Continent, COUNT(car_makers.Id) AS car_makers_count FROM continents LEFT JOIN countries ON countries.Continent = continents.ContId LEFT JOIN car_makers ON car_makers.Country = countries.CountryId GROUP BY continents.Continent;
p_sql: SELECT countries.CountryName FROM countries JOIN car_makers ON car_makers.Country = countries.CountryId GROUP BY countries.CountryName ORDER BY COUNT(car_makers.Id) DESC LIMIT 1;
p_sql: SELECT countries.CountryName FROM countries JOIN car_makers ON countries.CountryId = car_makers.Country GROUP BY countries.CountryName ORDER BY COUNT(car_makers.Id) DESC LIMIT 1;
p_sql: SELECT car_makers.Maker, car_makers.FullName, COUNT(model_list.ModelId) AS ModelCount FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker GROUP BY car_makers.Id;
p_sql: SELECT car_makers.Id, car_makers.FullName, COUNT(model_list.ModelId) AS NumCarModels FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker GROUP BY car_makers.Id, car_makers.FullName;
p_sql: SELECT cars_data.Accelerate FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker JOIN car_names ON model_list.ModelId = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE car_makers.Maker = 'amc' AND model_list.Model = 'hornet sportabout (sw)';
p_sql: SELECT Accelerate FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model JOIN car_makers ON model_list.Maker = car_makers.Id WHERE car_makers.Maker = 'amc' AND car_makers.FullName = 'hornet sportabout (sw)';
p_sql: SELECT COUNT(*) FROM car_makers WHERE Country = 'france';
p_sql: SELECT COUNT(DISTINCT Maker) FROM car_makers WHERE Country = 'France';
p_sql: SELECT COUNT(DISTINCT c.ModelId) FROM cars_data c JOIN car_names cn ON c.Id = cn.MakeId JOIN model_list ml ON cn.Model = ml.Model JOIN car_makers cm ON ml.Maker = cm.Id JOIN countries co ON cm.Country = co.CountryId WHERE co.CountryName = 'usa';
p_sql: SELECT COUNT(*) FROM car_names JOIN model_list ON car_names.Model = model_list.Model JOIN car_makers ON model_list.Maker = car_makers.Id JOIN countries ON car_makers.Country = countries.CountryId WHERE countries.CountryName = 'United States';
p_sql: SELECT AVG(cars_data.MPG) FROM cars_data WHERE cars_data.Cylinders = 4;
p_sql: SELECT AVG(MPG) FROM cars_data WHERE Cylinders = 4;
p_sql: SELECT MIN(cars_data.Weight) FROM cars_data WHERE cars_data.Cylinders = 8 AND cars_data.Year = 1974;
p_sql: SELECT MIN(Weight) FROM cars_data WHERE Cylinders = 8 AND Year = 1974;
p_sql: SELECT car_makers.Maker, model_list.Model FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker;
p_sql: SELECT car_makers.Maker, model_list.Model FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker;
p_sql: SELECT countries.CountryName, countries.CountryId FROM countries WHERE countries.CountryId IN ( SELECT car_makers.Country FROM car_makers )
p_sql: SELECT countries.CountryId, countries.CountryName FROM countries INNER JOIN car_makers ON car_makers.Country = countries.CountryId;
p_sql: SELECT COUNT(*) FROM cars_data WHERE Horsepower > 150;
p_sql: SELECT COUNT(*) FROM cars_data WHERE Horsepower > 150;
p_sql: SELECT AVG(Weight), Year FROM cars_data GROUP BY Year;
p_sql: SELECT AVG(Weight) AS AverageWeight, Year FROM cars_data GROUP BY Year;
p_sql: SELECT countries.CountryName FROM countries WHERE countries.Continent = (SELECT continents.ContId FROM continents WHERE continents.Continent = 'Europe') GROUP BY countries.CountryName HAVING COUNT(DISTINCT car_makers.Id) >= 3;
p_sql: SELECT CountryName FROM car_makers JOIN countries ON car_makers.Country = countries.CountryId JOIN continents ON countries.Continent = continents.ContId WHERE continents.Continent = 'Europe' GROUP BY countries.CountryName HAVING COUNT(DISTINCT car_makers.Id) >= 3;
p_sql: SELECT cars_data.Horsepower, car_makers.Maker FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model JOIN car_makers ON model_list.Maker = car_makers.Id WHERE cars_data.Cylinders = 3 ORDER BY cars_data.Horsepower DESC LIMIT 1;
p_sql: SELECT MAX(cars_data.Horsepower) AS MaxHorsepower, car_makers.Maker FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.ModelId WHERE cars_data.Cylinders = 3 GROUP BY car_makers.Maker ORDER BY MaxHorsepower DESC LIMIT 1;
p_sql: SELECT cars_data.Model FROM cars_data WHERE MPG = (SELECT MAX(MPG) FROM cars_data);
p_sql: SELECT Model FROM cars_data ORDER BY MPG DESC LIMIT 1;
p_sql: SELECT AVG(Horsepower) FROM cars_data WHERE Year < 1980;
p_sql: SELECT AVG(Horsepower) FROM cars_data WHERE Year < 1980;
p_sql: SELECT AVG(cars_data.Edispl) FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model JOIN car_makers ON model_list.Maker = car_makers.Id WHERE car_makers.Maker = 'volvo';
p_sql: SELECT AVG(cars_data.Edispl) FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model JOIN car_makers ON model_list.Maker = car_makers.Id WHERE car_makers.Maker = 'Volvo';
p_sql: SELECT MAX(Accelerate), Cylinders FROM cars_data GROUP BY Cylinders;

APIError: ignored

In [ ]:

df = pd.DataFrame(prediction, columns=['predict_sql'])

# Save DataFrame to CSV
df.to_csv('predict233.csv', index=False)

In [ ]:
prediction=pd.read_csv('predict233.csv')['predict_sql'].values

In [ ]:

sqls = []
for gold_sql,predicted_sql in zip(df_val[0:233].values,prediction):
        sqls.append([gold_sql[0].strip(),gold_sql[1].strip(),predicted_sql.strip(';')])

In [ ]:
sqls

[['concert_singer',
  'SELECT count(*) FROM singer',
  'SELECT COUNT(*) FROM singer'],
 ['concert_singer',
  'SELECT count(*) FROM singer',
  'SELECT COUNT(*) FROM singer'],
 ['concert_singer',
  'SELECT name ,  country ,  age FROM singer ORDER BY age DESC',
  'SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC'],
 ['concert_singer',
  'SELECT name ,  country ,  age FROM singer ORDER BY age DESC',
  'SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC'],
 ['concert_singer',
  "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'",
  "SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'"],
 ['concert_singer',
  "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'",
  "SELECT MIN(Age) as Minimum_Age, MAX(Age) as Maximum_Age, AVG(Age) as Average_Age FROM singer WHERE Country = 'France'"],
 ['concert_singer',
  'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1',
  'SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = (SELECT MIN(Age) FROM singer)'],
 ['concert_singer',
  'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1',
  'SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = ( SELECT MIN(Age) FROM singer )'],
 ['concert_singer',
  'SELECT DISTINCT country FROM singer WHERE age  >  20',
  'SELECT DISTINCT Country FROM singer WHERE Age > 20'],
 ['concert_singer',
  'SELECT DISTINCT country FROM singer WHERE age  >  20',
  'SELECT DISTINCT Country FROM singer WHERE Age > 20'],
 ['concert_singer',
  'SELECT country ,  count(*) FROM singer GROUP BY country',
  'SELECT DISTINCT Country, COUNT(Singer_ID) FROM singer GROUP BY Country'],
 ['concert_singer',
  'SELECT country ,  count(*) FROM singer GROUP BY country',
  'SELECT COUNT(*), Country FROM singer GROUP BY Country'],
 ['concert_singer',
  'SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)',
  'SELECT singer.Song_Name FROM singer WHERE singer.Age > (SELECT AVG(Age) FROM singer)'],
 ['concert_singer',
  'SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)',
  'SELECT singer.Song_Name FROM singer WHERE singer.Age > ( SELECT AVG(Age) FROM singer )'],
 ['concert_singer',
  'SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000',
  'SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 5000 AND 10000'],
 ['concert_singer',
  'SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000',
  'SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 5000 AND 10000'],
 ['concert_singer',
  'select max(capacity), average from stadium',
  'SELECT MAX(capacity), AVG(capacity) FROM stadium'],
 ['concert_singer',
  'select avg(capacity) ,  max(capacity) from stadium',
  'SELECT AVG(Capacity), MAX(Capacity) FROM stadium'],
 ['concert_singer',
  'SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1',
  'SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = ( SELECT MAX(stadium.Average) FROM stadium )'],
 ['concert_singer',
  'SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1',
  'SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = (SELECT MAX(Average) FROM stadium)'],
 ['concert_singer',
  'SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015',
  'SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015'],
 ['concert_singer',
  'SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015',
  'SELECT COUNT(*) FROM concert WHERE Year = 2014 OR Year = 2015'],
 ['concert_singer',
  'SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id',
  'SELECT stadium.Name, COUNT(concert.concert_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY stadium.Name'],
 ['concert_singer',
  'SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id',
  'SELECT stadium.Name, COUNT(concert.concert_ID) as total_concerts FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID GROUP BY stadium.Name'],
 ['concert_singer',
  'SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1',
  'SELECT stadium.Name, stadium.Capacity FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year >= 2014 GROUP BY stadium.Stadium_ID ORDER BY COUNT(*) DESC LIMIT 1'],
 ['concert_singer',
  'select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1',
  'SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Stadium_ID = ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year > 2013 GROUP BY concert.Stadium_ID ORDER BY COUNT(*) DESC LIMIT 1 )'],
 ['concert_singer',
  'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
  'SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1'],
 ['concert_singer',
  'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
  'SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC LIMIT 1'],
 ['concert_singer',
  'SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)',
  'SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL'],
 ['concert_singer',
  'SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)',
  'SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL'],
 ['concert_singer',
  'SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30',
  'SELECT DISTINCT Country FROM singer WHERE Age > 40 INTERSECT SELECT DISTINCT Country FROM singer WHERE Age < 30'],
 ['concert_singer',
  'SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014',
  'SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 )'],
 ['concert_singer',
  'SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014',
  'SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 )'],
 ['concert_singer',
  'SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id',
  'SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_Name, concert.Theme'],
 ['concert_singer',
  'select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id',
  'SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert INNER JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_ID, concert.concert_Name, concert.Theme'],
 ['concert_singer',
  'SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id',
  'SELECT singer.Name, COUNT(singer_in_concert.concert_ID) as num_concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name'],
 ['concert_singer',
  'SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id',
  'SELECT singer.Name, COUNT(singer_in_concert.concert_ID) AS Number_of_Concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name'],
 ['concert_singer',
  'SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014',
  'SELECT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON concert.concert_ID = singer_in_concert.concert_ID WHERE concert.Year = 2014'],
 ['concert_singer',
  'SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014',
  'SELECT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON singer_in_concert.concert_ID = concert.concert_ID WHERE concert.Year = 2014'],
 ['concert_singer',
  "SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'",
  "SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE '%Hey%'"],
 ['concert_singer',
  "SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'",
  "SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE '%Hey%'"],
 ['concert_singer',
  'SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015',
  'SELECT stadium.Name, stadium.Location FROM stadium WHERE stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 ) AND stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2015 )'],
 ['concert_singer',
  'SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015',
  'SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 2014 INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 2015'],
 ['concert_singer',
  'select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)',
  'SELECT COUNT(*) FROM concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = (SELECT MAX(Capacity) FROM stadium) )'],
 ['concert_singer',
  'select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)',
  'SELECT COUNT(*) FROM concert WHERE stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = ( SELECT MAX(Capacity) FROM stadium ) )'],
 ['pets_1',
  'SELECT count(*) FROM pets WHERE weight  >  10',
  'SELECT COUNT(*) FROM Pets WHERE weight > 10'],
 ['pets_1',
  'SELECT count(*) FROM pets WHERE weight  >  10',
  'SELECT COUNT(*) FROM Pets WHERE weight > 10'],
 ['pets_1',
  'SELECT weight FROM pets ORDER BY pet_age LIMIT 1',
  "SELECT MIN(Pets.pet_age) AS youngest_age, Pets.weight FROM Pets WHERE Pets.PetType = 'dog'"],
 ['pets_1',
  'SELECT weight FROM pets ORDER BY pet_age LIMIT 1',
  "SELECT MIN(weight) FROM Pets WHERE PetType = 'dog'"],
 ['pets_1',
  'SELECT max(weight) ,  petType FROM pets GROUP BY petType',
  'SELECT MAX(weight) AS max_weight, PetType FROM Pets GROUP BY PetType'],
 ['pets_1',
  'SELECT max(weight) ,  petType FROM pets GROUP BY petType',
  'SELECT MAX(weight), PetType FROM Pets GROUP BY PetType'],
 ['pets_1',
  'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20',
  'SELECT COUNT(*) FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Age > 20'],
 ['pets_1',
  'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20',
  'SELECT COUNT(*) FROM Has_Pet INNER JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Student.Age > 20'],
 ['pets_1',
  "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'",
  "SELECT count(*) FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Pets.PetType = 'dog' AND Student.Sex = 'F'"],
 ['pets_1',
  "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'",
  "SELECT COUNT(*) FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Pets.PetType = 'dog' AND Student.Sex = 'female'"],
 ['pets_1',
  'SELECT count(DISTINCT pettype) FROM pets',
  'SELECT COUNT(DISTINCT PetType) FROM Pets'],
 ['pets_1',
  'SELECT count(DISTINCT pettype) FROM pets',
  'SELECT COUNT(DISTINCT PetType) FROM Pets'],
 ['pets_1',
  "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'",
  "SELECT Student.Fname FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog')"],
 ['pets_1',
  "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'",
  "SELECT Student.FName FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog')"],
 ['pets_1',
  "select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'",
  "SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Student.StuID IN ( SELECT StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' ) GROUP BY Student.Fname"],
 ['pets_1',
  "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'",
  "SELECT Student.Fname FROM Student WHERE EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'cat' ) AND EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'dog' )"],
 ['pets_1',
  "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  "SELECT Major, Age FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'Cat'))"],
 ['pets_1',
  "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  "SELECT Student.Major, Student.Age FROM Student WHERE Student.StuID NOT IN ( SELECT StuID FROM Has_Pet WHERE PetID IN ( SELECT PetID FROM Pets WHERE PetType = 'Cat' ) )"],
 ['pets_1',
  "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'",
  "SELECT Student.StuID FROM Student LEFT JOIN Has_Pet ON Student.StuID = Has_Pet.StuID LEFT JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType <> 'cat' OR Pets.PetType IS NULL"],
 ['pets_1',
  "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'",
  "SELECT Student.StuID FROM Student WHERE Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE PetType = 'Cat' )"],
 ['pets_1',
  "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  "SELECT Student.FName, Student.Age FROM Student WHERE Student.StuID IN ( \tSELECT Has_Pet.StuID \tFROM Has_Pet \tINNER JOIN Pets ON Has_Pet.PetID = Pets.PetID \tWHERE Pets.PetType = 'dog' ) AND Student.StuID NOT IN ( \tSELECT Has_Pet.StuID \tFROM Has_Pet \tINNER JOIN Pets ON Has_Pet.PetID = Pets.PetID \tWHERE Pets.PetType = 'cat' )"],
 ['pets_1',
  "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')",
  "SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' AND Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' )"],
 ['pets_1',
  'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1',
  'SELECT Pets.PetType, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets)'],
 ['pets_1',
  'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1',
  'SELECT Pets.PetType, Pets.pet_age, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets) LIMIT 1'],
 ['pets_1',
  'SELECT petid ,  weight FROM pets WHERE pet_age  >  1',
  'SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1'],
 ['pets_1',
  'SELECT petid ,  weight FROM pets WHERE pet_age  >  1',
  'SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1'],
 ['pets_1',
  'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype',
  'SELECT Pets.PetType, AVG(Pets.pet_age) AS average_age, MAX(Pets.pet_age) AS maximum_age FROM Pets GROUP BY Pets.PetType'],
 ['pets_1',
  'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype',
  'SELECT Pets.PetType, AVG(Pets.pet_age), MAX(Pets.pet_age) FROM Pets GROUP BY Pets.PetType'],
 ['pets_1',
  'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype',
  'SELECT PetType, AVG(weight) AS AverageWeight FROM Pets GROUP BY PetType'],
 ['pets_1',
  'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype',
  'SELECT Pets.PetType, AVG(Pets.weight) AS AverageWeight FROM Pets GROUP BY Pets.PetType'],
 ['pets_1',
  'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid',
  'SELECT Student.Fname, Student.Age FROM Student WHERE Student.StuID IN ( SELECT Has_Pet.StuID FROM Has_Pet )'],
 ['pets_1',
  'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid',

In [ ]:
!pip3 install sqlparse
#pip3 install nltk

Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (0.4.4)

In [ ]:
!pip3 install nltk

Requirement already satisfied: nltk in /usr/local/lib/python3.10/dist-packages (3.8.1)
Requirement already satisfied: click in /usr/local/lib/python3.10/dist-packages (from nltk) (8.1.7)
Requirement already satisfied: joblib in /usr/local/lib/python3.10/dist-packages (from nltk) (1.3.2)
Requirement already satisfied: regex>=2021.8.3 in /usr/local/lib/python3.10/dist-packages (from nltk) (2023.6.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from nltk) (4.66.1)

In [ ]:
import nltk
import sqlparse

In [ ]:

nltk.download('punkt')

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Unzipping tokenizers/punkt.zip.

True

In [ ]:
def get_accuracy(db_id,gold_sql,predicted_sql):
    with open('/content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt', 'w') as f:
        f.write(str(gold_sql) + "\t" + str(db_id))
    with open('/content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt', 'w') as f:
        f.write(predicted_sql)
    cmd_str = "python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec "
    result = subprocess.run(cmd_str, shell=True, capture_output=True, text=True)
    print(result)
    os.remove("/content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt")
    os.remove("/content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt")
    acc = float(result.stdout[-21:-16])
    return acc

In [ ]:
scc=[]

for row in sqls:
  scc.append(get_accuracy(row[0],row[1],row[2]))

CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                1                    0                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            1.000                0.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                1                    0                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            1.000                0.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                1.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                1.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                1.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                0.000                0.000                0.000                0.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                0.000                0.000                0.000                0.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                0                    1                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            0.000                0.000                0.000                0.000                0.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                1                    0                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            1.000                0.000                0.000                0.000                1.000               \n', stderr='')
CompletedProcess(args='python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec ', returncode=0, stdout='                     easy                 medium               hard                 extra                all                 \ncount                1                    0                    0                    0                    1                   \n=====================   EXECUTION ACCURACY     =====================\nexecution            1.000                0.000                0.000                0.000                1.000               \n', stderr='')

In [ ]:
str(predict_df['gold_sql'])+ "\t" + str(predict_df['db_id'])

'0                          SELECT count(*) FROM singer\n1                          SELECT count(*) FROM singer\n2    SELECT name ,  country ,  age FROM singer ORDE...\n3    SELECT name ,  country ,  age FROM singer ORDE...\n4    SELECT avg(age) ,  min(age) ,  max(age) FROM s...\n5    SELECT avg(age) ,  min(age) ,  max(age) FROM s...\n6    SELECT song_name ,  song_release_year FROM sin...\n7    SELECT song_name ,  song_release_year FROM sin...\n8    SELECT DISTINCT country FROM singer WHERE age ...\n9    SELECT DISTINCT country FROM singer WHERE age ...\nName: gold_sql, dtype: object\t0    concert_singer\n1    concert_singer\n2    concert_singer\n3    concert_singer\n4    concert_singer\n5    concert_singer\n6    concert_singer\n7    concert_singer\n8    concert_singer\n9    concert_singer\nName: db_id, dtype: object'

In [ ]:
predict_df= pd.DataFrame(sqls, columns=['db_id', 'gold_sql', 'predicted_sql'])
# Assuming 'predict_df' is your DataFrame
os.remove("/content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt")
os.remove("/content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt")
with open('/content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt', 'w') as f:
    for index, row in predict_df.iterrows():
        # Construct the string to write for each row
        line = row['gold_sql'] + "\t" + row['db_id'] + "\n"  # add a newline character to end each line
        f.write(line)

with open('/content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt', 'w') as f:
    for index, row in predict_df.iterrows():
        # Here, we assume that you want to write only the 'predicted_sql' to the file.
        line = row['predicted_sql'] + "\n"  # add a newline character to end each line
        f.write(line)

In [ ]:
cmd_str = "python3 /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --etype exec "
result=subprocess.run(cmd_str, shell=True, capture_output=True, text=True)

In [ ]:
!python /content/drive/MyDrive/test-suite-sql-eval-master/evaluation.py --gold /content/drive/MyDrive/test-suite-sql-eval-master/Gold_test.txt --pred /content/drive/MyDrive/test-suite-sql-eval-master/Predicted_test.txt --db /content/drive/MyDrive/test-suite-sql-eval-master/database/ --table /content/drive/MyDrive/test-suite-sql-eval-master/tables.json --etype all

medium pred: SELECT MIN(Age) as Minimum_Age, MAX(Age) as Maximum_Age, AVG(Age) as Average_Age FROM singer WHERE Country = 'France'
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = (SELECT MIN(Age) FROM singer)
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

medium pred: SELECT singer.Name, singer.Song_Name, singer.Song_release_year FROM singer WHERE singer.Age = ( SELECT MIN(Age) FROM singer )
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

medium pred: SELECT DISTINCT Country, COUNT(Singer_ID) FROM singer GROUP BY Country
medium gold: SELECT country ,  count(*) FROM singer GROUP BY country

medium pred: SELECT MAX(capacity), AVG(capacity) FROM stadium
medium gold: select max(capacity), average from stadium

medium pred: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = ( SELECT MAX(stadium.Average) FROM stadium )
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

medium pred: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Average = (SELECT MAX(Average) FROM stadium)
medium gold: SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1

medium pred: SELECT stadium.Name, COUNT(concert.concert_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY stadium.Name
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

medium pred: SELECT stadium.Name, COUNT(concert.concert_ID) as total_concerts FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID GROUP BY stadium.Name
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

extra pred: SELECT stadium.Name, stadium.Capacity FROM stadium WHERE stadium.Stadium_ID = ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year > 2013 GROUP BY concert.Stadium_ID ORDER BY COUNT(*) DESC LIMIT 1 )
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

hard pred: SELECT stadium.Name FROM stadium LEFT JOIN concert ON concert.Stadium_ID = stadium.Stadium_ID WHERE concert.Stadium_ID IS NULL
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

hard pred: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 )
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

hard pred: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 )
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

medium pred: SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_Name, concert.Theme
medium gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id

medium pred: SELECT concert.concert_Name, concert.Theme, COUNT(singer_in_concert.Singer_ID) FROM concert INNER JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY concert.concert_ID, concert.concert_Name, concert.Theme
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id

medium pred: SELECT singer.Name, COUNT(singer_in_concert.concert_ID) as num_concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

medium pred: SELECT singer.Name, COUNT(singer_in_concert.concert_ID) AS Number_of_Concerts FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Name
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

extra pred: SELECT stadium.Name, stadium.Location FROM stadium WHERE stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2014 ) AND stadium.Stadium_ID IN ( SELECT concert.Stadium_ID FROM concert WHERE concert.Year = 2015 )
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

hard pred: SELECT COUNT(*) FROM concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = (SELECT MAX(Capacity) FROM stadium) )
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

hard pred: SELECT COUNT(*) FROM concert WHERE stadium_ID IN ( SELECT Stadium_ID FROM stadium WHERE Capacity = ( SELECT MAX(Capacity) FROM stadium ) )
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

medium pred: SELECT MIN(Pets.pet_age) AS youngest_age, Pets.weight FROM Pets WHERE Pets.PetType = 'dog'
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT MIN(weight) FROM Pets WHERE PetType = 'dog'
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT MAX(weight) AS max_weight, PetType FROM Pets GROUP BY PetType
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

medium pred: SELECT COUNT(*) FROM Has_Pet INNER JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Student.Age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

extra pred: SELECT Student.Fname FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog')
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Student.FName FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType IN ('cat', 'dog')
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Student.StuID IN ( SELECT StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' ) GROUP BY Student.Fname
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student WHERE EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'cat' ) AND EXISTS ( SELECT 1 FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Has_Pet.StuID = Student.StuID AND Pets.PetType = 'dog' )
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

extra pred: SELECT Major, Age FROM Student WHERE StuID NOT IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'Cat'))
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

extra pred: SELECT Student.Major, Student.Age FROM Student WHERE Student.StuID NOT IN ( SELECT StuID FROM Has_Pet WHERE PetID IN ( SELECT PetID FROM Pets WHERE PetType = 'Cat' ) )
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

hard pred: SELECT Student.StuID FROM Student LEFT JOIN Has_Pet ON Student.StuID = Has_Pet.StuID LEFT JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType <> 'cat' OR Pets.PetType IS NULL
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT Student.StuID FROM Student WHERE Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE PetType = 'Cat' )
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

extra pred: SELECT Student.FName, Student.Age FROM Student WHERE Student.StuID IN (
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'dog' AND Student.StuID NOT IN ( SELECT Has_Pet.StuID FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' )
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

medium pred: SELECT Pets.PetType, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets)
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT Pets.PetType, Pets.pet_age, Pets.weight FROM Pets WHERE Pets.pet_age = (SELECT MIN(pet_age) FROM Pets) LIMIT 1
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT Pets.PetType, AVG(Pets.pet_age) AS average_age, MAX(Pets.pet_age) AS maximum_age FROM Pets GROUP BY Pets.PetType
medium gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT PetType, AVG(weight) AS AverageWeight FROM Pets GROUP BY PetType
medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT Pets.PetType, AVG(Pets.weight) AS AverageWeight FROM Pets GROUP BY Pets.PetType
medium gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype

medium pred: SELECT Student.Fname, Student.Age FROM Student WHERE Student.StuID IN ( SELECT Has_Pet.StuID FROM Has_Pet )
medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid

medium pred: SELECT Student.FName, Student.Age FROM Student WHERE Student.StuID IN ( SELECT StuID FROM Has_Pet )
medium gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid

medium pred: SELECT Pets.PetID FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.LName = 'Smith'
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

medium pred: SELECT Pets.PetID FROM Has_Pet JOIN Student ON Has_Pet.StuID = Student.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.LName = 'Smith'
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

medium pred: SELECT COUNT(*) as pet_count, Has_Pet.StuID FROM Has_Pet GROUP BY Has_Pet.StuID
medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid

medium pred: SELECT Has_Pet.StuID, COUNT(Has_Pet.PetID) FROM Has_Pet GROUP BY Has_Pet.StuID;
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid

medium pred: SELECT Student.Fname, Student.Sex FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID GROUP BY Student.StuID HAVING COUNT(Has_Pet.PetID) > 1
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

medium pred: SELECT Student.Fname, Student.Sex FROM Student WHERE Student.StuID IN (SELECT StuID FROM Has_Pet GROUP BY StuID HAVING COUNT(*) > 1)
medium gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1

hard pred: SELECT Student.LName FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID INNER JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'cat' AND Pets.pet_age = 3 ORDER BY Student.LName DESC LIMIT 1
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

easy pred: SELECT COUNT(ContId) FROM continents
easy gold: SELECT count(*) FROM CONTINENTS;

medium pred: SELECT continents.ContId, continents.Continent, COUNT(countries.CountryId) AS country_count FROM continents JOIN countries ON continents.ContId = countries.Continent GROUP BY continents.ContId, continents.Continent
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT continents.ContId, continents.Continent, COUNT(countries.CountryId) AS Number_of_Countries FROM continents JOIN countries ON countries.Continent = continents.ContId GROUP BY continents.ContId, continents.Continent
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

easy pred: SELECT COUNT(DISTINCT CountryId) FROM countries
easy gold: SELECT count(*) FROM COUNTRIES;

medium pred: SELECT car_makers.FullName, car_makers.Id, COUNT(model_list.ModelId) as Number_of_Models FROM car_makers JOIN model_list ON model_list.Maker = car_makers.Id GROUP BY car_makers.Id
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

medium pred: SELECT car_makers.Id, car_makers.FullName, COUNT(model_list.Model) AS NumOfModels FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker GROUP BY car_makers.Id, car_makers.FullName
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT Model FROM cars_data WHERE Horsepower = (SELECT MIN(Horsepower) FROM cars_data)
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

hard pred: SELECT min(car_data.Horsepower) as Min_Horsepower, car_names.Model as Car_Model FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId ORDER BY Min_Horsepower LIMIT 1
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT model_list.Model FROM model_list WHERE model_list.ModelId IN ( SELECT car_names.Model FROM car_names JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Weight < ( SELECT AVG(cars_data.Weight) FROM cars_data ) )
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT model_list.Model FROM cars_data JOIN car_names ON cars_data.Id = car_names.MakeId JOIN model_list ON car_names.Model = model_list.Model WHERE cars_data.Weight < (SELECT AVG(Weight) FROM cars_data)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT car_makers.Maker FROM car_makers JOIN car_names ON car_makers.Id = car_names.MakeId JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT car_makers.Maker FROM car_makers JOIN cars_data ON car_makers.Id = cars_data.Id WHERE cars_data.Year = 1970 GROUP BY car_makers.Maker
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT car_makers.Maker, cars_data.Year FROM car_makers JOIN car_names ON car_makers.Id = car_names.MakeId JOIN cars_data ON car_names.Model = cars_data.Model WHERE cars_data.Year = (SELECT MIN(Year) FROM cars_data)
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

extra pred: SELECT car_makers.Maker, MIN(cars_data.Year) FROM car_makers INNER JOIN car_names ON car_makers.Id = car_names.MakeId INNER JOIN model_list ON car_names.Model = model_list.Model INNER JOIN cars_data ON car_names.MakeId = cars_data.Id GROUP BY car_makers.Maker ORDER BY MIN(cars_data.Year) LIMIT 1
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT model_list.Model FROM model_list JOIN car_makers ON model_list.Maker = car_makers.Id JOIN car_names ON model_list.ModelId = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year > 1980
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;


In [ ]:
result.stdout[-20:-15]

'.700 '